In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('income.csv')
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

## Calculating mean and median:

In [3]:
df['Monthly Income ($)'].mean()

1433928.5714285714

In [4]:
df['Monthly Income ($)'].median()

7000.0

In [5]:
df['Monthly Income ($)'].mode()

0        4000
1        5000
2        6000
3        7000
4        7500
5        8000
6    10000000
Name: Monthly Income ($), dtype: int64

## Removing outliers:

### Calculating quartile values:

In [6]:
df['Monthly Income ($)'].quantile(0.25)

5500.0

In [7]:
df['Monthly Income ($)'].quantile(0.9)

4004800.0000000037

### Removing outliers:

In [8]:
x=df['Monthly Income ($)'].quantile(0.9)
x

4004800.0000000037

In [9]:
df_outlier_free=df[df['Monthly Income ($)']<=x]
df_outlier_free

    Name  Monthly Income ($)
0    Rob                5000
1  Rafiq                6000
2   Nina                4000
3  Sofia                7500
4  Mohan                8000
5    Tao                7000

## Data Cleaning:

In [11]:
df['Monthly Income ($)'][3]=np.NaN
df

C:\Users\MYPC\AppData\Local\Temp\ipykernel_12092\922913036.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Monthly Income ($)'][3]=np.NaN

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia                 NaN
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0

In [12]:
df['Monthly Income ($)']=df['Monthly Income ($)'].fillna(df['Monthly Income ($)'].median())
df

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia              6500.0
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0